Revit 2027 API
EndCapCondition Enumeration
 Used by CompoundStructure to describe which shell layers participate in end wrapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum EndCapCondition
Public Enumeration EndCapCondition
public enum class EndCapCondition
type EndCapCondition
Members
Member name | Value | Description
Exterior | 1 |  Only the exterior shell layers participate in end wrapping.
Interior | 2 |  Only the interior shell layers participate in end wrapping.
NoEndCap | 3 |  No end wrapping ability. Floors and roofs must use this enum value.
None | 0 |  None of the shell layers participate in end wrapping.
See Also
Reference
Autodesk.Revit.DB Namespace